Revit 2024 API
BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostError Property
 Fabric Sheet is placed completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricSheetOutSideOfHostError { get; }
Visual Basic
Public Shared ReadOnly Property FabricSheetOutSideOfHostError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricSheetOutSideOfHostError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace